#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NmU3YjdkNi1lMjMwLTQ4ZGEtOGJkOC1iMDNmMzNmMmYxZDI7b2JqZWN0SWQ9M2JlYWFjODEtOWYyMy00ZmNiLWFlMzctZTg4NjAzY2RkMzJmO3N1YnNjcmlwdGlvbklkPTkxY2U5ZWZmLThiZGItNDZiNi05ZmQ5LTc3MjI4MjhhNjg5MTt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-ecommerce]
module.rc.azurerm_redis_cache.rc: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Cache/redis/redis-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerRegistry/registries/crEcommerceAuto]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/virtualNetworks/vnet-ecommerce]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerService/managedClusters/aks-ecommerce]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/virtualNetworks/vnet-ecommerce/subnets/snet-ecommerce]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/networkInterfaces/ni-ecommerce]
module.mysql.azurerm_mysql_flexible_server.mysql: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.DBforMySQL/flexibleServers/ecommerce-autoiac-mysqlserver]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/networkInterfaces/ni-ecommerce|/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-ecommerce]
module.mysql_firewall.azurerm_mysql_flexible_server_firewall_rule.mysql_firewall: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.DBforMySQL/flexibleServers/ecommerce-autoiac-mysqlserver/firewallRules/allow_all_ips]
module.mysql_configuration.azurerm_mysql_flexible_server_configuration.mysql_configuration: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.DBforMySQL/flexibleServers/ecommerce-autoiac-mysqlserver/configurations/require_secure_transport]
module.sa.azurerm_storage_management_policy.sa_policy: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage/managementPolicies/default]
module.helm.helm_release.kp: Refreshing state... [id=prometheus-auto]
module.ss.azurerm_storage_share.ss: Refreshing state... [id=https://mysonarqubestorage.file.core.windows.net/mysonarqubedata]
module.cg.azurerm_container_group.cg: Refreshing state... [id=/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.azurerm_kubernetes_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + custom_ca_trust_certificates_base64              = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = (sensitive value)
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "ecommerce-rg-auto"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.ContainerService/managedClusters/aks-ecommerce"
        name                                = "aks-ecommerce"
        tags                                = {
            "Environment" = "Prod"
            "Service"     = "Auto"
        }
        # (28 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "default"
            tags                         = {}
            # (22 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.helm.helm_release.kube-prometheus will be created
  + resource "helm_release" "kube-prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "kube-public"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "36.2.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

  # module.mysql.azurerm_mysql_flexible_server.mysql will be updated in-place
  ~ resource "azurerm_mysql_flexible_server" "mysql" {
        id                            = "/subscriptions/91ce9eff-8bdb-46b6-9fd9-7722828a6891/resourceGroups/ecommerce-rg-auto/providers/Microsoft.DBforMySQL/flexibleServers/ecommerce-autoiac-mysqlserver"
        name                          = "ecommerce-autoiac-mysqlserver"
        tags                          = {
            "Environment" = "Prod"
            "Service"     = "Auto"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

</details>

*Pusher: @G20-00, Action: `pull_request`, Workflow: `On Pull Request`*